Poiseuille_flow_OpenFoam/Poiseuille/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)
    (4 0 0)
    (4 1 0)
    (0 1 0)
    (0 0 1)
    (4 0 1)
    (4 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (320 80 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type cyclic;
        neighbourPatch outlet;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type cyclic;
        neighbourPatch inlet;	
        faces
        (
            (2 6 5 1)
        );
    }

    fixedWalls
    {
        type wall;
        faces
        (
	    (3 7 6 2)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
